# Pandas_3 Writing,Reading into excel,csv etc Files

In [1]:
%%HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/-0NwrcZOKhQ?si=iv01saQvo0xcmGj9" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

**Here I dont have above file prescribed in youtube i wrote an dataframe and using it to extract a csv file**

In [26]:
import pandas as pd
df=pd.DataFrame({
    'Tickers': ['GOOGL', 'WMT', 'MSFT', 'RIL', 'TATA'],
    'EPS': [27.82, 4.61, -1, 'not available', 5.6],
    'Revenue': [88, 484, 85, 50, -1],
    'Price': [87, 65, 64, 1023,'n.a'],
    'People': ['larry page', 'n.a.', 'bill gates', 'mukesh ambani', 'ratan tata']

})
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       88    87     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

In [4]:
df.to_csv('stocks_data.csv',index=False)

# Now the Lecture Starts

**here we added an extra row to csv file Stocks Data and we have to skip that and apply it to current csv file**

In [7]:
df2=pd.read_csv("stocks_data.csv")
df2

  Stocks Data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     Tinkers            EPS    Revenue      Price         People
1       GOOGL          27.82         88         87     larry page
2         WMT           4.61        484         65           n.a.
3        MSFT             -1         85         64     bill gates
4         RIL  not available         50       1023  mukesh ambani
5        TATA            5.6         -1        n.a     ratan tata

In [14]:
df3=pd.read_csv("stocks_data.csv",skiprows=1) #(also does the same thing in place of skiprows=1 we can apply header=1)

In [15]:
df3

   Tinkers            EPS  Revenue Price         People
0    GOOGL          27.82       88    87     larry page
1      WMT           4.61      484    65           n.a.
2     MSFT             -1       85    64     bill gates
3      RIL  not available       50  1023  mukesh ambani
4     TATA            5.6       -1   n.a     ratan tata

**observe the difference btw above 2 steps i.e btw df2 and df3**

*now the case if header is not existing*

In [19]:
df4=pd.read_csv("stocks_data.csv")
df4 #here when you do normally googl,27.82 etc are appearing in the rows which is wrong as it is part of our data it musnt be a header

  GOOGL          27.82   88    87     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2   RIL  not available   50  1023  mukesh ambani
3  TATA            5.6   -1   n.a     ratan tata

In [21]:
df5=pd.read_csv("stocks_data.csv",header=None)
df5 
#here as you see the header is not there to our csv file so this effect must take place but here 0,1,2,3,4 are not suggestible or bad so we have to change the names of header

       0              1    2     3              4
0  GOOGL          27.82   88    87     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3    RIL  not available   50  1023  mukesh ambani
4   TATA            5.6   -1   n.a     ratan tata

In [23]:
df6=pd.read_csv("stocks_data.csv",header=None,names=['Tickers','EPS', 'Revenue','Price', 'People'])
df6

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       88    87     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

***so after modifying the csv file it looks so good and it can be managable also observe the difference between df 4,5,6***

****Now reading Limited Data****

In [25]:
df7=pd.read_csv("stocks_data.csv")
df7

   Tinkers            EPS  Revenue Price         People
0    GOOGL          27.82       88    87     larry page
1      WMT           4.61      484    65           n.a.
2     MSFT             -1       85    64     bill gates
3      RIL  not available       50  1023  mukesh ambani
4     TATA            5.6       -1   n.a     ratan tata

In [28]:
df8=pd.read_csv("stocks_data.csv",nrows=3)
df8

   Tinkers    EPS  Revenue  Price      People
0    GOOGL  27.82       88     87  larry page
1      WMT   4.61      484     65        n.a.
2     MSFT  -1.00       85     64  bill gates

**replacing n.a and not available values with NaN**

In [32]:
df9=pd.read_csv("stocks_data.csv")
df9

   Tinkers            EPS  Revenue Price         People
0    GOOGL          27.82       88    87     larry page
1      WMT           4.61      484    65           n.a.
2     MSFT             -1       85    64     bill gates
3      RIL  not available       50  1023  mukesh ambani
4     TATA            5.6       -1   n.a     ratan tata

In [33]:
df10=pd.read_csv("stocks_data.csv",na_values=["not available","n.a","n.a."])
df10

   Tinkers    EPS  Revenue   Price         People
0    GOOGL  27.82       88    87.0     larry page
1      WMT   4.61      484    65.0            NaN
2     MSFT  -1.00       85    64.0     bill gates
3      RIL    NaN       50  1023.0  mukesh ambani
4     TATA   5.60       -1     NaN     ratan tata

**observe the difference btw df9 and df10  n.a and not available values are converted to NaN thats good and there is other problem here in revenue there is a -1 in data which is actually a wrong so we convert that into NaN also, So for that we supply dictionary values to na_values**

In [6]:
df11=pd.read_csv("stocks_data.csv",na_values={
    'EPS':["not available","n.a","n.a."],
    'Revenue':["not available","n.a","n.a.",-1],
    'Price':["not available","n.a","n.a."],
    'People':["not available","n.a","n.a."],
})
df11

   Tinkers    EPS  Revenue   Price         People
0    GOOGL  27.82     88.0    87.0     larry page
1      WMT   4.61    484.0    65.0            NaN
2     MSFT  -1.00     85.0    64.0     bill gates
3      RIL    NaN     50.0  1023.0  mukesh ambani
4     TATA   5.60      NaN     NaN     ratan tata

**writing into csv file is same as what we done at start additionally we have header=False,which helps to not export header to csv file and by getting row names we can direct them to new csv file using column names see below for reference**

In [37]:
df11.to_csv("new.csv")

In [13]:
%%HTML
<img src="new2.png">

In [38]:
df11.columns

Index([' Tinkers', 'EPS', 'Revenue', 'Price', 'People'], dtype='object')

In [7]:
df11.to_csv("new1.csv",columns=[' Tinkers', 'EPS']) #here only 2 columns i.e tinkers,eps will gone to csv file

In [10]:
%%HTML
<img src="new1.png">

In [8]:
df11.to_csv("new2.csv",header=False,index=False) #this wont send header,index to csv_file

In [11]:
%%HTML
<img src="new.png">

***now doing same type of operations in excel file***

In [5]:
import pandas as pd
df=pd.DataFrame({
    'Tickers': ['GOOGL', 'WMT', 'MSFT', 'RIL', 'TATA'],
    'EPS': [27.82, 4.61, -1, 'not available', 5.6],
    'Revenue': [88, 484, 85, 50, -1],
    'Price': [87, 65, 64, 1023,'n.a'],
    'People': ['larry page', 'n.a.', 'bill gates', 'mukesh ambani', 'ratan tata']

})
df

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       88    87     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

In [8]:
df.to_excel("stocks_data.xlsx",sheet_name="Stocks") #making up excel file

**now doing operations in excel file**

In [3]:
import pandas as pd
def convert_people_cell(cell):
    if cell=="n.a.":
        return "Sam Walton"
    else:
        return cell
df12=pd.read_excel("stocks_data.xlsx","Stocks",converters={
    'People':convert_people_cell
})
df12

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       88    87     larry page
1     WMT           4.61      484    65     Sam Walton
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

**want to do additional thing mean while the data given here is so small where anyone can manipulate then wbt 1,00,000 data given and we cant modify using dictionaries everytime so what we gonna do is write a function which does your work easily for example i am modifying excel file so that two revenues are negative i will modify them using the functions and then i will revert back to normal excel file and do operations as given in the video itself**

In [29]:
df13=pd.read_excel("stocks_data_1.xlsx","Stocks")
df13

  Tickers            EPS  Revenue Price         People
0   GOOGL          27.82       88    87     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available     -345  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

In [30]:
import numpy as np
nan_value=np.nan #NAN is available in numpy else can use None
def conv_people_cell(cell):
    if cell=="n.a.":
        return "Sam Walton"
    else:
        return cell
def convert_revenue_negtives(cell):
    if cell<0:
        return nan_value #else we can use None also in place nan_value 
    else:
        return cell
def conv_eps_cell(cell):
    if cell=="not available":
        return None
    else:
        return cell
df14=pd.read_excel("stocks_data_1.xlsx","Stocks",converters={
    'People':conv_people_cell,
    'EPS':conv_eps_cell,
    'Revenue':convert_revenue_negtives
})
df14

  Tickers    EPS  Revenue Price         People
0   GOOGL  27.82     88.0    87     larry page
1     WMT   4.61    484.0    65     Sam Walton
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN      NaN  1023  mukesh ambani
4    TATA   5.60      NaN   n.a     ratan tata

In [31]:
df14.columns

Index(['Tickers', 'EPS', 'Revenue', 'Price', 'People'], dtype='object')

In [36]:
df14.to_excel("completely_modified_usable.xlsx",sheet_name="Modified",index=False)

In [37]:
%%HTML
<img src="usable.png" >

In [39]:
df15=df14
df15.to_excel("completely_modified_usable.xlsx",sheet_name="Modified",index=False,startrow=1,startcol=2)

In [40]:
%%HTML
<img src="usable1.png">

**now writing two data frames into a single excel file**

In [43]:
df_stocks = pd. DataFrame({
'tickers': ['GOOGL', 'WMT', 'MSFT'],
'price': [845, 65, 64],
'pe': [30.37, 14.26, 30.97],
'eps': [27.82, 4.61, 2.12]
})

df_weather = pd.DataFrame ({
'day': ['1/1/2017', '1/2/2017', '1/3/2017'],
'temperature': [32,35,28],
'event': ['Rain', 'Sunny', 'Snow']
})

In [44]:
df_stocks

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

In [45]:
df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [48]:
with pd.ExcelWriter("stocks_weather.xlsx") as Writer:
    df_stocks.to_excel(Writer,sheet_name="Stocks")
    df_weather.to_excel(Writer,sheet_name="Weather")

In [49]:
%%HTML
<img src="Stocks_Weather.png">

***More Read,Write Functions are prescribed in below link***


<a href="https://pandas.pydata.org/docs/reference/io.html">LINK</a>